test/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="100000" />
  </clients>
 
  <servers>
    <server host="127.0.0.3" port="8001" type="tcp" />
    <!--<server host="46.8.22.202" port="80" type="tcp" />-->
    <!--<server host="app.comet-server.ru" port="80" type="tcp" />-->
  </servers>

  <load>
    <arrivalphase phase="1" duration="100" unit="second">
       <users arrivalrate="1" unit="second"/>
    </arrivalphase>
  </load>
   
  <sessions>
    <session name="websocket" probability="100" type="ts_websocket">
        <request subst="true">
             <websocket type="connect" path="/ws/sesion=&amp;myid=&amp;devid=1&amp;v=1.80&amp;api=js"></websocket>
        </request>
                
        <request>
            <websocket type="message" ack="no_ack">web_pipe
web_chat_pipe
CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA000B</websocket>
        </request>  
        <request>
            <websocket type="message" ack="no_ack">web_pipe
web_chat_pipe
CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA001B</websocket>
        </request>  
        <request>
            <websocket type="message" ack="no_ack">web_pipe
web_chat_pipe
CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA002B</websocket>
        </request>  
        <request>
            <websocket type="message" ack="no_ack">web_pipe
web_chat_pipe
CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA003B</websocket>
        </request>  
        <request>
            <websocket type="message" ack="no_ack">web_pipe
web_chat_pipe
CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA004B</websocket>
        </request>  
        <request>
            <websocket type="message" ack="no_ack">web_pipe
web_chat_pipe
CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA005B</websocket>
        </request>  
        <request>
            <websocket type="message" ack="no_ack">web_pipe
web_chat_pipe
CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA006B</websocket>
        </request>  
        <request>
            <websocket type="message" ack="no_ack">web_pipe
web_chat_pipe
CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA007B</websocket>
        </request>  
        <request>
            <websocket type="message" ack="no_ack">web_pipe
web_chat_pipe
CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA008B</websocket>
        </request>  
        <request>
            <websocket type="message" ack="no_ack">web_pipe
web_chat_pipe
CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA009B</websocket>
        </request>  
        <request>
            <websocket type="message" ack="no_ack">web_pipe
web_chat_pipe
CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAB</websocket>
        </request>  
        <request>
            <websocket type="message" ack="no_ack">web_pipe
web_chat_pipe
CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAB</websocket>
        </request>  
        <request>
            <websocket type="message" ack="no_ack">web_pipe
web_chat_pipe
CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAB</websocket>
        </request>  
        <request>
            <websocket type="message" ack="no_ack">web_pipe
web_chat_pipe
CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAB</websocket>
        </request>  
        <request>
            <websocket type="message" ack="no_ack">web_pipe
web_chat_pipe
CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAB</websocket>
        </request>
        
        
        <request>
            <websocket type="close"></websocket>
        </request>
    </session>
  </sessions>
</tsung>